{
  "headline": "Creative Management | Consulting | Media Music Agency",
  "company": "<p><em>At Like Minded Management</em>, we strive to create an environment that changes the way composers think about representation. Our goal is to partner with our clients in their endeavors, navigating together from beginning to end. We are a collection of artists, musicians, creators, managers, and agents who utilize our up-to-the-minute industry knowledge to collaborate alongside the artists and their team to help with creative development.</p><p>We have more than a decade of experience developing some of Hollywood’s leading award-winning composers, aiding them in the creative film scoring process. Whether it is pursuing a career in scoring, or finding a publisher or record label, to securing legal representation or collaborators, we and our clients are like-minded in our mission, and focused on providing a directional but collaborative approach for today’s ever-changing media landscape.</p><p>Innovative and forward-thinking artists don’t need anyone telling them what to do, but instead helping them realize, manage, and create their goals. Our agents and managers will solely focus on that mission. To inspire creatives for creation, providing contacts and knowledge to help artists realize those goals and defend their works with integrity and passion. As technology evolves around our industry, we also harness the power of both Artificial Intelligence and Data technologies to track, analyze, and provide our clients with the insight they need to find the partners to create. </p>",
  "leadership": "<p>Kevin Korn is a dynamic and accomplished agent who has spent over 10 years in the film music industry enriching the lives and careers of accomplished and budding forward-thinking artists and composers.  Kevin is known globally for his ability to develop and nurture a new, diverse generation of film and television composers, many of whom are already destined to be Hollywood's A-list composers of tomorrow.</p><p>Kevin's passion for music started very young, when he played a variety of musical instruments including saxophone.  He earned a degree in Music Composition from The University of the Arts, Philadelphia. Immediately upon graduation, he went on to work for the music-crossover department of the prestigious Creative Artists Agency, assisting pop musicians as they transitioned into film composition.  While at CAA, Kevin, along with a number of industry colleagues, started one of the leading networking groups for film and TV music called SYNCH THIS.  The group now has over 1800+ members.</p><p>At the age of 25, Kevin became the industry's youngest film music agent when he was hired by the prestigious Gorfaine/Schwartz Agency.  Within his first two years at GSA, Kevin expanded the roster by developing such notable clients as the late Jóhann Jóhannsson (Theory of Everything, Sicario), Oscar winner Steven Price (Gravity, Suicide Squad), Sarah Schachner (Anthem, Call of Duty: Infinite Warfare), Joseph Trapanese (Oblivion, Straight Outta Compton) Photek (How to Get Away with Murder, Station 19) Ryan Lott aka Son Lux (The Disappearance of Eleanor Rigby, Paper Towns),  Alex Somers (Captain Fantastic, Honey Boy) Anthony Gonzalez of the band M83 (Oblivion), Eskmo (Billions, 13 Reasons Why), Amie Doherty(Undone, Jurassic Park: Battle at Little Rock and many of the next generation of diverse artists. In 2013 at the age of 28, Kevin was recognized by Variety's prestigious NEW HOLLYWOOD LEADERS annual list.</p><p>Kevin's passion is to educate the general public about film and television music by finding ways to make composers and their scores more popular among wider audiences, and by helping to build bridges between film composers and contemporary recording artists.</p><p>In 2018 after the passing of two-time Oscar nominee Johann Johannsson, Kevin helped launch THE JOHANN JOHANNSSON FOUNDATION whose mission is to inspire artists to express themselves through music and the process of composing.</p><p>In October 2019, Kevin launched LIKE-MINDED MANAGEMENT a creative management, consulting, and music media agency.</p>"
}